wisteria-1c/Конфигурация/Catalogs/ПодписиПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодписиПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Может быть в формате HTML или в формате Простого текста</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ПодписиПисем/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьФормуПоПараметрам(Параметры);
	ИзменитьФормуПоРолиПользователя();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбработкаЗаписиПодписи(ИмяСобытия, Параметр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Предпросмотр.Видимость Тогда
		ПодключитьОбработчикОжидания("ОбработчикСписокПриАктивизацииСтроки", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ЭтоФормаСписка Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элемент.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
	"Справочник.ПодписиПисем.Форма.ФормаЭлемента",
	ПараметрыФормы,
	ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПредпросмотрДокументСформирован(Элемент)
	
	ГипертекстКлиент.ПрименитьНастройкиОтображения(Элемент.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредпросмотрПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ГипертекстКлиент.ДокументHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФорму("Справочник.ПодписиПисем.Форма.Настройки", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаСобытийФормы

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработкаЗаписиПодписи(ИмяСобытия, Параметр)
	
	Если ИмяСобытия <> "Запись_ПодписьПисем" Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаЗаписиПодписиНаСервере(Параметр);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаЗаписиПодписиНаСервере(Знач Ссылка)
	
	СодержаниеПодписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Содержание");
	
	Если СтрНайти(СодержаниеПодписи, "<html") Тогда
		Содержание = СодержаниеПодписи;
	Иначе
		Содержание = ГипертекстВызовСервера.HTMLИзПростогоТекста(СодержаниеПодписи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ВидФормы

&НаСервере
Процедура НастроитьФормуПоПараметрам(Параметры)
	
	Параметры.Свойство("ЭтоФормаСписка", ЭтоФормаСписка);
	Элементы.Список.РежимВыбора = Не ЭтоФормаСписка;
	
	ТолькоСписок = Неопределено;
	Параметры.Свойство("ТолькоСписок", ТолькоСписок);
	Если ТолькоСписок = Истина Тогда
		ОставитьНаФормеТолькоСписок();
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоФормаСписка Тогда
		УстановитьОтборПоВладельцу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОставитьНаФормеТолькоСписок()
	
	УстановитьОтборПоВладельцу();
	
	Элементы.Предпросмотр.Видимость = Ложь;
	Элементы.Настройки.Видимость = Ложь;
	
	АвтоЗаголовок = Ложь;
	Заголовок = НСтр("ru = 'Подписи писем'");
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФормуПоРолиПользователя()
	
	Если Пользователи.ЭтоПолноправныйПользователь(Пользователи.ТекущийПользователь()) Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ВладелецПодписи.Видимость Тогда
		УстановитьОтборПоВладельцу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВладельцу()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	"ВладелецПодписи", Пользователи.ТекущийПользователь(), , , Истина);
	
	Элементы.ВладелецПодписи.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область Содержание

&НаКлиенте
Процедура ОбработчикСписокПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
	ОбработчикСписокПриАктивизацииСтрокиНаСервере(ДанныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикСписокПриАктивизацииСтрокиНаСервере(ДанныеСтроки)
	
	Если СтрНайти(ДанныеСтроки.Содержание, "<html") Тогда
		Содержание = ДанныеСтроки.Содержание;
	Иначе
		Содержание = ГипертекстВызовСервера.HTMLИзПростогоТекста(ДанныеСтроки.Содержание);
	КонецЕсли;
	
	Элементы.Предпросмотр.Заголовок = СтрШаблон(
	НСтр("ru = 'Содержание подписи ""%1""'"), ДанныеСтроки.Наименование);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Предпросмотр.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти
